{
  "basics": {
    "name": "Marko Andersson",
    "label": "Clean coder | Full stack unicorn working with Java and JavaScript | Lean and \"real agile\" enthusiast",
    "picture": "",
    "email": "",
    "phone": "",
    "website": "https://markoandersson.info",
    "summary": "Back in my early career, I was converting requirements to software using the first working solution. Not anymore.  I realized how important it was to create sustainable solutions and that led me to the world of clean code, refactoring, design patterns, unit testing, working with legacy code, clean architecture, and other disciplines, which ensured that my solutions were simple and elegant. But most of all, they were written for other developers, not for myself. I'm still recommended continuously for these subjects.  Nowadays I've learned that it doesn't matter how elegant the solution is if it doesn't solve the user's problems. I'm on a path to learn Lean principles and true agile development, and how we can use feedback loops to guide our development. I prefer collaboration and conversations over requirement documents and contracts.   I consider myself as a full stack developer as my expertise covers the back-end development with Java and Spring framework, the latest front-end JavaScript technologies such as React and Redux. I know about DevOps and how it can be used to enable fast feedback loops.  I try to teach, help and mentor, I listen and learn constantly. I'm happy to share my knowledge, and I expect others to do the same.",
    "location": {
      "address": "",
      "postalCode": "Finland",
      "city": "Jyväskylä",
      "countryCode": "FI",
      "region": ""
    },
    "profiles": [
      {
        "network": "Twitter",
        "username": "",
        "url": "https://twitter.com/marko_andersson"
      },
      {
        "network": "LinkedIn",
        "username": "",
        "url": "https://www.linkedin.com/in/markoandersson/"
      },
      {
        "network": "GitHub",
        "username": "@marko_andersson",
        "url": "https://github.com/markoandersson"
      }
    ]
  },
  "work": [
    {
      "company": "Solteq Oyj",
      "position": "Senior Developer",
      "website": "",
      "startDate": "2014-09-01",
      "summary": "Designing and developing microservice architectures using Spring Boot/Cloud, modern front-end development with JS/React/Redux using ES2015. Contributing to a continuous delivery pipeline with automated testing and fast deployment and feedback cycles. Trying to adopt lean software development principles.  Finding migration paths when transforming a monolith application to a separate microservices.  Development of large enterprise web application using Spring, Spring boot, JEE, Hibernate, and JSP. UI test automation with Serenity-framework.  Trying to increase awareness of how to deal with legacy code, especially how to add new features without adding complexity to the existing code.   Refactoring of existing code to reduce complexity and improve readability. Whining about missing unit tests and trying to convince how important good tests are.  Various cloud and DevOps stuff.",
      "highlights": []
    },
    {
      "company": "Star Arcade",
      "position": "Senior software developer",
      "website": "",
      "startDate": "2012-05-01",
      "summary": "Designing and implementing CMS-system for game developers to modify, synchronizing and publishing game related data to test and production databases.  Designing and implementing highly available and scalable communication server systems. Enterprise communication system based on JMS. Web applications. Server controlling and monitoring. Collecting and presenting history data. Different types of REST-interfaces for clients. Data access optimization with clustered databases (Cassandra). User interfaces with Vaadin. Leading project team.",
      "highlights": [],
      "endDate": "2014-09-01"
    },
    {
      "company": "Kilosoft Oy",
      "position": "Software engineer / Senior SW engineer",
      "website": "",
      "startDate": "2007-01-01",
      "summary": "Designing and implementing various different types of software, mainly web based applications, for customers. User management systems, Certificate management systems, public key infrastructure (PKI) Database design, integration and migration. Software architecture design, testing, documentation, project planning, requirement specification, and reporting, and Scrum-related tasks. Interacting with customers.",
      "highlights": [],
      "endDate": "2012-05-01"
    },
    {
      "company": "University of Jyväskylä",
      "position": "Trainee",
      "website": "",
      "startDate": "2006-06-01",
      "summary": "",
      "highlights": [],
      "endDate": "2006-11-01"
    }
  ],
  "education": [
    {
      "institution": "University of Jyväskylä",
      "area": "",
      "studyType": "Master's degree",
      "startDate": "2002-01-01",
      "gpa": "",
      "courses": [],
      "endDate": "2006-01-01"
    }
  ],
  "publications": [
    {
      "name": "Supporting IPS-systems with Netflow",
      "publisher": "University of Jyväskylä",
      "releaseDate": "2006-11-29",
      "website": "http://research.jyu.fi/laila/IPS_Netflow_Gradu.pdf",
      "summary": ""
    }
  ],
  "skills": [
    {
      "name": "Java",
      "level": "",
      "keywords": []
    },
    {
      "name": "Vue.js",
      "level": "",
      "keywords": []
    },
    {
      "name": "Spring Framework",
      "level": "",
      "keywords": []
    },
    {
      "name": "Unit Testing",
      "level": "",
      "keywords": []
    },
    {
      "name": "Web Services",
      "level": "",
      "keywords": []
    },
    {
      "name": "Continuous Integration",
      "level": "",
      "keywords": []
    },
    {
      "name": "Design Patterns",
      "level": "",
      "keywords": []
    },
    {
      "name": "Web Applications",
      "level": "",
      "keywords": []
    },
    {
      "name": "Software Design",
      "level": "",
      "keywords": []
    },
    {
      "name": "Architecture",
      "level": "",
      "keywords": []
    },
    {
      "name": "Scrum",
      "level": "",
      "keywords": []
    },
    {
      "name": "Test Automation",
      "level": "",
      "keywords": []
    },
    {
      "name": "Test Driven Development",
      "level": "",
      "keywords": []
    },
    {
      "name": "Agile Methodologies",
      "level": "",
      "keywords": []
    },
    {
      "name": "REST",
      "level": "",
      "keywords": []
    },
    {
      "name": "MySQL",
      "level": "",
      "keywords": []
    },
    {
      "name": "React.js",
      "level": "",
      "keywords": []
    },
    {
      "name": "Docker",
      "level": "",
      "keywords": []
    },
    {
      "name": "JavaScript",
      "level": "",
      "keywords": []
    },
    {
      "name": "SQL",
      "level": "",
      "keywords": []
    },
    {
      "name": "Spring",
      "level": "",
      "keywords": []
    },
    {
      "name": "Java Enterprise Edition",
      "level": "",
      "keywords": []
    },
    {
      "name": "Hibernate",
      "level": "",
      "keywords": []
    },
    {
      "name": "JMS",
      "level": "",
      "keywords": []
    },
    {
      "name": "HTML",
      "level": "",
      "keywords": []
    },
    {
      "name": "Git",
      "level": "",
      "keywords": []
    },
    {
      "name": "Microsoft Azure",
      "level": "",
      "keywords": []
    },
    {
      "name": "Amazon Web Services (AWS)",
      "level": "",
      "keywords": []
    },
    {
      "name": "Microservices",
      "level": "",
      "keywords": []
    },
    {
      "name": "Continuous Delivery",
      "level": "",
      "keywords": []
    },
    {
      "name": "Ansible",
      "level": "",
      "keywords": []
    },
    {
      "name": "Lean Software Development",
      "level": "",
      "keywords": []
    },
    {
      "name": "Cassandra",
      "level": "",
      "keywords": []
    },
    {
      "name": "Domain Modeling",
      "level": "",
      "keywords": []
    },
    {
      "name": "Vagrant",
      "level": "",
      "keywords": []
    },
    {
      "name": "DevOps",
      "level": "",
      "keywords": []
    }
  ],
  "languages": [
    {
      "language": "Finnish",
      "fluency": null
    },
    {
      "language": "English",
      "fluency": null
    }
  ],
  "references": [
    {
      "name": "Jani Immonen - Napko",
      "reference": "Marko is a hard working, analytical professional, and a pleasure to work with. His contribution to server system design and development has been invaluable. I will gladly recommend Marko for his software design, development, and communcational skills."
    },
    {
      "name": "Jussi Kuittinen - Apus Consulting Oy",
      "reference": "Marko just might be the cleanest coder I have ever had the pleasure of knowing. Having worked with him for about a year, I have learned to really appreciate his drive to improving the maintainability and elegance of the code around and ahead of him. And: his approach is practical and supportive of others.  However, to me the greatest thing about him is that he is a team-first -kind of guy. He will accept responsibility of the team’s deliverables, can do any role (architect, coder, tester, scrum master) and do it well, will strive for perfecting the processes and Is always ready to help a team member in need. He is the kind of guy you really want in your team.   I would genuinely like to work with him again."
    },
    {
      "name": "Ville Törmälä - Solteq Oyj",
      "reference": "If you want an experienced software development professional in your team, look for guys like Marko. He is equipped with excellent technical skills and can handle any technical problem. Every team also needs members who want to create solutions with excellent quality and push team's technical standards forward. That's why me and other Marko's team members greatly appreciate his attitude of not being satisfied with mediocre results. Marko also is one the guys who is not only familiar with agile and lean ways of working but knows how to do it in practice."
    },
    {
      "name": "Tuomas-Matti Soikkeli - Nordcloud",
      "reference": "Marko's enthusiasm to clean code is unparalleled. But more importantly, Markos aura generates clean code around him. I owe him a great thanks for teaching me how to imagine code. It is not the syntax or the functions, but a poem which describes your intentions. With this in mind, I can write readable and robust code that every developer after me will understand.   Also, Marko will tell very bad jokes."
    },
    {
      "name": "Juha Heimonen - Flowa",
      "reference": "Marko is a wonder-boy on what comes to Java and especially Spring! I had the honor to work with him for a year, and learned soooo much about the good practices what comes to keeping code in order and patterns in place.    Marko is an avid learner who manages to inspire others as well, as teach ways to become a better programmer. +10 would work with him again!"
    }
  ]
}
